In [1]:
import pandas as pd
import numpy as np

### Korea

In [2]:
korea_alc = pd.read_excel("data/alcohol-korea.xlsx")

In [3]:
korea_alc.head()

  Spirits Consumption Per Capita in South Korea              Unnamed: 1
0                                           NaN                     NaN
1                                          Date  Liters of Pure Alcohol
2                                          2019                   0.612
3                                          2018                   0.599
4                                          2017                   0.587

In [4]:
korea_alc["Unnamed: 1"].isna().sum()

5

In [5]:
# check if rows with nan values are important

korea_na = korea_alc.loc[korea_alc["Unnamed: 1"].isna()]

In [6]:
korea_na

        Spirits Consumption Per Capita in South Korea Unnamed: 1
0                                                 NaN        NaN
61                                                NaN        NaN
62                  Source: World Health Organization        NaN
63          Curated and published by NationMaster at:        NaN
64  https://www.nationmaster.com/nmx/timeseries/so...        NaN

In [7]:
# dropping nan and reseting index

korea_alc = korea_alc.dropna(inplace = False).reset_index(drop = True)

In [8]:
# rename the columns

korea_alc = korea_alc.rename(columns = {"Spirits Consumption Per Capita in South Korea" : "Year", "Unnamed: 1" : "Alcohol per Capita"})

In [9]:
korea_alc = korea_alc.drop(korea_alc.index[0]).reset_index(drop = True)

In [10]:
korea_alc.head()

   Year Alcohol per Capita
0  2019              0.612
1  2018              0.599
2  2017              0.587
3  2016              0.574
4  2015               0.64

In [11]:
# sorting values ascending by year

korea_alc = korea_alc.sort_values(by = "Year").reset_index(drop = True)

In [13]:
# Create new column with country name

korea_alc["country"] = "REPUBLIC OF KOREA"

korea_alc.head()

   Year Alcohol per Capita            country
0  1961               0.41  REPUBLIC OF KOREA
1  1962               0.41  REPUBLIC OF KOREA
2  1963               0.34  REPUBLIC OF KOREA
3  1964               0.33  REPUBLIC OF KOREA
4  1965                0.5  REPUBLIC OF KOREA

In [14]:
# save dataframe

korea_alc.to_csv("data/korea_alcohol_cons.csv", index = False)

### US

In [15]:
usa_alc = pd.read_excel("data/alcohol-US.xlsx")

In [16]:
usa_alc

             Spirits Consumption Per Capita in the US              Unnamed: 1
0                                                 NaN                     NaN
1                                                Date  Liters of Pure Alcohol
2                                                2019                    3.17
3                                                2018                    3.14
4                                                2017                    3.11
..                                                ...                     ...
61                                               1960                    3.26
62                                                NaN                     NaN
63                  Source: World Health Organization                     NaN
64          Curated and published by NationMaster at:                     NaN
65  https://www.nationmaster.com/nmx/timeseries/un...                     NaN

[66 rows x 2 columns]

In [17]:
usa_alc["Unnamed: 1"].isna().sum()

5

In [18]:
# check if rows with nan values are important

usa_na = usa_alc.loc[usa_alc["Unnamed: 1"].isna()]
usa_na

             Spirits Consumption Per Capita in the US Unnamed: 1
0                                                 NaN        NaN
62                                                NaN        NaN
63                  Source: World Health Organization        NaN
64          Curated and published by NationMaster at:        NaN
65  https://www.nationmaster.com/nmx/timeseries/un...        NaN

In [19]:
# dropping nan and reseting index

usa_alc = usa_alc.dropna(inplace = False).reset_index(drop = True)

In [20]:
usa_alc.head()

  Spirits Consumption Per Capita in the US              Unnamed: 1
0                                     Date  Liters of Pure Alcohol
1                                     2019                    3.17
2                                     2018                    3.14
3                                     2017                    3.11
4                                     2016                    3.09

In [21]:
# rename the columns

usa_alc = usa_alc.rename(columns = {"Spirits Consumption Per Capita in the US" : "Year", "Unnamed: 1" : "Alcohol per Capita"})

In [22]:
usa_alc.head()

   Year      Alcohol per Capita
0  Date  Liters of Pure Alcohol
1  2019                    3.17
2  2018                    3.14
3  2017                    3.11
4  2016                    3.09

In [23]:
# dropping first row

usa_alc = usa_alc.drop(usa_alc.index[0]).reset_index(drop = True)

In [24]:
usa_alc.head()

   Year Alcohol per Capita
0  2019               3.17
1  2018               3.14
2  2017               3.11
3  2016               3.09
4  2015               3.07

In [25]:
# sorting values ascending by year

usa_alc = usa_alc.sort_values(by = "Year").reset_index(drop = True)

In [26]:
usa_alc.head()

   Year Alcohol per Capita
0  1960               3.26
1  1961               3.26
2  1962               3.41
3  1963               3.44
4  1964                3.6

In [27]:
# Create new column with country name
usa_alc["country"] = "UNITED STATES"

usa_alc.head()

   Year Alcohol per Capita        country
0  1960               3.26  UNITED STATES
1  1961               3.26  UNITED STATES
2  1962               3.41  UNITED STATES
3  1963               3.44  UNITED STATES
4  1964                3.6  UNITED STATES

In [28]:
usa_alc.to_csv("data/usa_alcohol_cons.csv", index = False)

### Russia

In [29]:
russia_alc = pd.read_excel("data/alcohol-Russia.xlsx")

In [30]:
russia_alc.head()

  Spirits Consumption Per Capita in Russia              Unnamed: 1
0                                      NaN                     NaN
1                                     Date  Liters of Pure Alcohol
2                                     2019                     2.6
3                                     2018                    2.81
4                                     2017                    3.02

In [31]:
# check nan

russia_alc["Unnamed: 1"].isna().sum()

5

In [32]:
# check if rows with nan values are important
russia_na = russia_alc.loc[russia_alc["Unnamed: 1"].isna()]

russia_na

             Spirits Consumption Per Capita in Russia Unnamed: 1
0                                                 NaN        NaN
59                                                NaN        NaN
60                  Source: World Health Organization        NaN
61          Curated and published by NationMaster at:        NaN
62  https://www.nationmaster.com/nmx/timeseries/ru...        NaN

In [33]:
# dropping nan and reseting index

russia_alc = russia_alc.dropna(inplace = False).reset_index(drop = True)

russia_alc.head()

  Spirits Consumption Per Capita in Russia              Unnamed: 1
0                                     Date  Liters of Pure Alcohol
1                                     2019                     2.6
2                                     2018                    2.81
3                                     2017                    3.02
4                                     2016                    3.25

In [34]:
# rename the columns
russia_alc = russia_alc.rename(columns = {"Spirits Consumption Per Capita in Russia" : "year", "Unnamed: 1" : "alcohol per capita"})

In [35]:
# dropping first row
russia_alc = russia_alc.drop(russia_alc.index[0]).reset_index(drop = True)

In [36]:
# sorting values ascending by year
russia_alc = russia_alc.sort_values(by = "year").reset_index(drop = True)

russia_alc.head()

   year alcohol per capita
0  1963               4.27
1  1964                4.4
2  1965               4.58
3  1966               4.61
4  1967               4.92

In [37]:
# Create new column with country name

russia_alc["country"] = "RUSSIAN FEDERATION"

russia_alc.head()

   year alcohol per capita             country
0  1963               4.27  RUSSIAN FEDERATION
1  1964                4.4  RUSSIAN FEDERATION
2  1965               4.58  RUSSIAN FEDERATION
3  1966               4.61  RUSSIAN FEDERATION
4  1967               4.92  RUSSIAN FEDERATION

In [38]:
russia_alc.to_csv("data/russia_alcohol_cons.csv", index = False)

### Japan

In [39]:
japan_alc = pd.read_excel("data/alcohol_cons_japan.xlsx")

In [41]:
japan_alc.head()

  Spirits Consumption Per Capita in Japan              Unnamed: 1
0                                     NaN                     NaN
1                                    Date  Liters of Pure Alcohol
2                                    2019                    2.67
3                                    2018                    2.68
4                                    2017                    2.69

In [42]:
# check nan

japan_alc["Unnamed: 1"].isna().sum()

5

In [43]:
# check if rows with nan values are important
japan_na = japan_alc.loc[japan_alc["Unnamed: 1"].isna()]

japan_na

              Spirits Consumption Per Capita in Japan Unnamed: 1
0                                                 NaN        NaN
61                                                NaN        NaN
62                  Source: World Health Organization        NaN
63          Curated and published by NationMaster at:        NaN
64  https://www.nationmaster.com/nmx/timeseries/ja...        NaN

In [44]:
# dropping nan and reseting index

japan_alc = japan_alc.dropna(inplace = False).reset_index(drop = True)

japan_alc.head()

  Spirits Consumption Per Capita in Japan              Unnamed: 1
0                                    Date  Liters of Pure Alcohol
1                                    2019                    2.67
2                                    2018                    2.68
3                                    2017                    2.69
4                                    2016                     2.7

In [45]:
# rename the columns
japan_alc = japan_alc.rename(columns = {"Spirits Consumption Per Capita in Japan" : "year", "Unnamed: 1" : "alcohol per capita"})

In [46]:
# dropping first row
japan_alc = japan_alc.drop(japan_alc.index[0]).reset_index(drop = True)

In [47]:
# sorting values ascending by year
japan_alc = japan_alc.sort_values(by = "year").reset_index(drop = True)

japan_alc.head()

   year alcohol per capita
0  1961               2.08
1  1962               2.05
2  1963               1.91
3  1964               1.79
4  1965               1.51

In [48]:
# Create new column with country name

japan_alc["country"] = "JAPAN"

japan_alc.head()

   year alcohol per capita country
0  1961               2.08   JAPAN
1  1962               2.05   JAPAN
2  1963               1.91   JAPAN
3  1964               1.79   JAPAN
4  1965               1.51   JAPAN

In [49]:
japan_alc.to_csv("data/japan_alcohol_cons.csv", index = False)